"上次连接的设备" = "Last connected device";
"乐投" = "HappyCast";
"投屏操作指引" = "HappyCast Instruction";
"确定" = "OK";
"选择设备,把视频投到电视上看" = "select a device then cast the videos to your Smart-TV";
"让您的手机同屏到电视上" = "mirror device screens to your Smart-TV";
"下载“乐播投屏”" = "Download HappyCast";
"正在寻找设备..." = "Looking for device...";
"收起" = "Cancel";
"乐播投屏技术支持" = "Technical support by HappyCast";
"提示" = "Quick Tips";
"打开“乐播投屏”" = "Open HappyCast";
"下载“乐播投屏”" = "Download HappyCast";
"选择要投屏的电视" = "Select the Smart-TV to be cast or mirrored";
"正在寻找设备" = "Looking for device";
"可将手机里的任何内容投屏到电视" = "Share all contents from your device to Smart-TVs";
"手机需与电视连接同一WiFi" = "Make sure your device and the Smart-TV are on the same WiFi/local network";
"没有搜索到电视" = "No search for any device";
"请在电视应用商店下载并\r打开乐播投屏,扫码连接电视" = "Please download and install HappyCast from the Smart-TV APP Store. Launch the app and scan QR code on the screen then connect to the Smart-TV.";
"扫一扫" = "Scan";
"视频推送" = "push videos";
"将视频投到电视上看" = "cast the videos to Smart-TV";
"屏幕镜像" = "Screen Mirroring";
"手机画面同步到电视" = "Mirror the display screen to TV";
"扫码连接电视" = "Scan QR code";
"相机权限未打开,扫码不能用,前往设置允许相机访问吧" = "Please allow HappyCast to access your device`s camera in Settings - Privacy - Camera";
"取消" = "Cancel";
"去设置" = "Go to set";
"与电视同一" = "On the same WIFI with the Smart-TV";
"温馨提示" = "Quick Tips";
"手机与电视不在同一局域网,请把手机切换到%@网络,去系统“设置”-->“无线局域网”更换" = "your device and Smart-TV are not on the same WIFI/local net,please switch your device`s wireless network to %@ in “Settings” - “WLAN”";
"知道了" = "OK";
"请重启电视上“乐播投屏”app再扫码" = "Please reboot the HappyCast on your Smart-TV and focus the camera on the QR code shown on Smart-TV";
"无法识别该二维码\n请扫描TV“乐播投屏”主页面二维码" = "can not identify this QR code\n please run HappyCast and focus the camera on the QR code shown on Smart-TV";
"请在电视上下载并打开“乐播投屏”,扫一扫主页面二维码" = "Please download and install HappyCast from the Smart-TV APP Store. Launch the app and scan QR code on the screen then connect to the Smart-TV.";
"手机未连接WiFi，请切换到与电视同一网络" = "our device and Smart-TV are not on the same WIFI/local net, please switch your device`s wireless the same as the Smart-TV`s";
"关闭投屏" = "Close";
"电视接收端太老,无法投屏,只支持镜像" = "The version of your HappyCast on your Smart-TV is only support Screen Mirroring,you can get other functions like video/photo cast for updating your HappyCast";
"当前电视上乐播投屏版本过低，仅支持镜像。想要更多功能请在各大电视应用商店下载乐播投屏最新版" = "The version of your HappyCast on your Smart-TV is only support Screen Mirroring,you can get other functions like video/photo cast for updating your HappyCast";
"电视接收端太老,无法投屏" = "The version of your HappyCast on your Smart-TV is only support Screen Mirroring,you can get other functions like video/photo cast for updating your HappyCast";
"当前电视上乐播投屏版本过低,需要升级才能播放哦" = "The version of your HappyCast on your Smart-TV is only support Screen Mirroring,you can get other functions like video/photo cast for updating your HappyCast";
"现在升级" = "Updating now";
"当前电视上乐播投屏版本过低，仅支持镜像。想要更多功能请在电视上安装乐播投屏最新版" = "The version of your HappyCast on your Smart-TV is only support Screen Mirroring, you can get other functions like video/photo cast for updating your HappyCast";
"安装" = "Install";
"连接电视失败" = "Failed connect";
"连接电视失败,请稍后再试" = "Failed connect ,please try again later";
"该设备不支持Mirror" = "This device can not support mirror";
"接收端拒绝您的连接" = "The receiver refused your connect access";
"请输入授权码" = "Please enter the code";
"请在设备上点击允许，然后重新推送" = "Tap “allow” on your device and try again later";
"接收端拒绝了您的连接" = "The receiver refused your connect access";
"推送的视频Url为空" = "There is no URL through your video push";
"您推送的视频地址为空,请重新投屏" = "There is no URL through your video push, please try again later";
"知道啦" = "OK";
"推送的视频Url无效" = "The video URL you pushed was useless";
"您推送的视频无法播放,请重新投屏" = "The video URL you pushed was useless, please try again later";
"电视接收器正在更新" = "The receiver is updating";
"电视下载乐播投屏失败,请重试" = "HappyCast failed downloading, please try again later";
"重新下载" = "Download again";
"连接电视失败,请重启电视上乐播投屏再试" = "Failed connect, please reboot HappyCast application on your Smart-TV";
"未连接接收端" = "Receiver unconnect";
"该渠道不支持透传功能" = "This channel can not support mirror cast";
"数据为空" = "Data empty";
"数据超过4KB" = "Data size exceeds 4KB";
"数据不是json或者xml格式" = "Data Format is not json or xml";
"castLink_guide_image" = "castLink_guide_image_en";
"在电视上安装新的乐播投屏" = "Update HappyCast on your TV";
"安装后投屏更稳定" = "More stable";
"投屏体验更流畅" = "More fluid";
"可以get更多投屏技能" = "Get More function";
"点击安装" = "Install";
